Tekla Open API Reference for Tekla Structures 2025
MaterialName Class
 The MaterialName class contains the name of the material item.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.MaterialName
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class MaterialName
Public NotInheritable Class MaterialName
The MaterialName type exposes the following members.
Constructors
Name | Description
MaterialName
Initializes a new instance of the MaterialName class
Top
Properties
Name | Description
Name
 The material item name.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace